Este archivo es la solucion de la actividad del Jueves 10 de Julio

In [5]:
import pandas as pd
import numpy as np
import openpyxl

In [8]:
# Load the Excel file
df = pd.read_excel('Muestreo_sistematico\Actividad_Retail_Clientes.xlsx')

<>:2: SyntaxWarning: invalid escape sequence '\A'
<>:2: SyntaxWarning: invalid escape sequence '\A'
C:\Users\Mateo\AppData\Local\Temp\ipykernel_16616\467896452.py:2: SyntaxWarning: invalid escape sequence '\A'
  df = pd.read_excel('Muestreo_sistematico\Actividad_Retail_Clientes.xlsx')

In [9]:
df.head()

   ID  HoraIngreso  Compra  MontoCompra
0   1           13       1         6.99
1   2           19       0         0.00
2   3           16       0         0.00
3   4           15       1        26.24
4   5           12       0         0.00